{
	"en": {
		"context": "Context",
		"key1": "Fist Key",
		"key2": "Second Key",
		"key3": "Third Key",
		"master_key": "Master Key",
		
		"hash_message_input": "Insert the message you want to be used to create the output: ",
		"safe_mode_input": "Would you like to turn on safe mode? (0,1): ",
		"lock_input": "Would you like to limit the password output? 0 for no limit 1-256: ",
		"generate_message_input": "Would you like to generate a hash for the master key? (0,1): ",
		"generate_rounds_input": "Select (in bits) the number of calculations you want the generator to do: ",
		"base_permission_input": "Do you want a base85 password and the service supports it? (0,1): ",
		"value_set_input": "Set a value for ",

		"clear_button": "Clear",
		"generate_button": "Generate",

		"safe_mode_instruction": "Safe mode determines if the values inputted will be displayed on sceen, for better security, choose ON",
		"safe_mode_warning": "Its important to keep the keys, context and the master key as a secret or private for more security",
		"generate_hash_instruction": "When you choose to generate a hash, youre given the option to select the length of the prime number used, if not given a number, a default of 8 bits will be used, for your knowledge, the length will be 2 elevated to the power of your input, for sake of performance, choose a number between 6-10",
		"generate_hash_calculated": "Will be calculated this number of rounds: ",
		
		"password_length": "The password this number of characters: ",
		"hash_show": "Would you like to display the hash? (0,1): ",
		"program_ending": "Ending the program...",
		
		"value_error": "Please input available options",
		"value_error_for_limit": "Please, input a available option (-1 to finish the program, 0 for no limit and max of 256",

		"loop_interaction": "Would you like to generate another password? (0,1): "
	},

	"pt-br": {
		"context": "Contexto",
		"key1": "Chave 1",
		"key2": "Chave 2",
		"key3": "Chave 3",
		"master_key": "Chave mestre",

		"hash_message_input": "Insira uma messagem para utilizar na geração do hash: ",
		"safe_mode_input": "Gostaria de ativar o modo seguro? (0,1): ",
		"lock_input": "Gostaria de limitar o tamanho da senha? 0 para sem limite, 1-256: ",
		"generate_message_input": "Gostaria de gerar uma senha criptografada para substituir a chave mestra? (0,1): ",
		"generate_rounds_input": "Selecione (em bits) a quantidade de calculos que você gostaria que fosse calculado: ",
		"base_permission_input": "Você quer uma senha em base85 e o serviço a suporta? (0,1): ",
		"value_set_input": "Insira um valor para ",

		"clear_button": "Limpar",
		"generate_button": "Gerar",

		"safe_mode_instruction": "O modo seguro determina se os valores colocados serão mostrados na tela, para maior segurança, mantenha-o ativado",
		"safe_mode_warning": "É importante manter as chaves, contexto e chave mestras um segredo ou privadas, para maior segurança",
		"generate_hash_instruction": "Quando você opta por gerar um hash, você tem a opção de selecionar o comprimento do número primo usado, se não for dado um número, um padrão de 8 bits será usado, para seu conhecimento, o comprimento será 2 elevado à potência de sua entrada, por uma questão de desempenho, escolha um número entre 6-10",
		"generate_hash_calculated": "Será realizado essa quantidade de calculos: ",

		"password_length": "Essa senha possui essa quantidade de caracteres: ",
		"hash_show": "Gostaria que o hash fosse mostrado? (0,1): ",
		"program_ending": "Finalizando o programa...",

		"value_error": "Escolha um valor disponível, por favor",
		"value_error_for_limit": "Por favor, escolha uma opção disponível (-1 para finalizar o programa, 0 para sem limites ou máximo de 256",

		"loop_interation": "Gostaria de gerar uma nova senha? (0,1): "
	}
}
